In [13]:
import pandas as pd
import numpy as np
import matplotlib

# Working on convert data in pandas series

In [14]:
list = [1,2,3,4,5,6,6]
df = pd.Series(list)
print(df)

0    1
1    2
2    3
3    4
4    5
5    6
6    6
dtype: int64

In [15]:
data = np.array([1,2,3,45,5,7,7])
pd.Series(data)

0     1
1     2
2     3
3    45
4     5
5     7
6     7
dtype: int32

In [16]:
data = np.array([1,2,3])
pd.Series(index=[1,2,3], data =data)

1    1
2    2
3    3
dtype: int32

In [17]:
dict_ = {'teja':1,'viskey':2,'chatiu':3}
pd.Series(data = dict_)

teja      1
viskey    2
chatiu    3
dtype: int64

Repeat function and reset_index function:-

In [18]:
pd.Series(5).repeat(5).reset_index(drop = True)

0    5
1    5
2    5
3    5
4    5
dtype: int64

In [19]:
 s = pd.Series([1,2,3]).repeat([5,3,1]).reset_index(drop = True)

In [20]:
s[7]

2

In [21]:
df = pd.Series([1,2,3,4,5,6])

Aggration function as agg

In [25]:
df.agg([min,max,sum])

C:\Users\tejan\AppData\Local\Temp\ipykernel_2364\2074020333.py:1: FutureWarning: The provided callable <built-in function min> is currently using Series.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  df.agg([min,max,sum])
C:\Users\tejan\AppData\Local\Temp\ipykernel_2364\2074020333.py:1: FutureWarning: The provided callable <built-in function max> is currently using Series.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  df.agg([min,max,sum])
C:\Users\tejan\AppData\Local\Temp\ipykernel_2364\2074020333.py:1: FutureWarning: The provided callable <built-in function sum> is currently using Series.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  df.agg([min,max,sum])

      0
min -34
max   2
sum -31

# absolute function

In [26]:
df = pd.DataFrame([1,2,-34])

In [27]:
print(df.abs())

    0
0   1
1   2
2  34

In [28]:
sr1 = pd.Series([1,2,30,4,5,6,7,8,9,20])
sr1

0     1
1     2
2    30
3     4
4     5
5     6
6     7
7     8
8     9
9    20
dtype: int64

## between function :- used to print between values...

In [29]:
sr1.between(10,50)

0    False
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8    False
9     True
dtype: bool

## String functions:-
->upper(),

->lower(),

->strip(),

->find(),

->startwith(),

->endswith()

In [30]:
ser = pd.Series(["Eshant Das" , "Data Science" , "Geeks for Geeks" , 'Hello World' , 'Machine Learning'])
print(ser.str.upper())
print('-'*25)
print(ser.str.lower())

0          ESHANT DAS
1        DATA SCIENCE
2     GEEKS FOR GEEKS
3         HELLO WORLD
4    MACHINE LEARNING
dtype: object
-------------------------
0          eshant das
1        data science
2     geeks for geeks
3         hello world
4    machine learning
dtype: object

In [31]:
ser = pd.Series(["Eshant Das" , "Data Science" , "Geeks for Geeks" , 'Hello World' , 'Machine Learning'])
for i in ser:
    print(len(i))

10
12
15
11
16

In [32]:
ser = pd.Series(["Eshant Das " , " Data  Science" , "Geeks for Geeks" , 'Hello World' , 'Machine Learning'])
for i in ser:
    print(len(i))
print('-'*25)    
ser1 = ser.str.strip()
for i in ser1:
    print(len(i))

11
14
15
11
16
-------------------------
10
13
15
11
16

In [33]:
print(ser)
print('*'*25)
ser.str.strip()

0         Eshant Das
1       Data  Science
2     Geeks for Geeks
3         Hello World
4    Machine Learning
dtype: object
*************************

0          Eshant Das
1       Data  Science
2     Geeks for Geeks
3         Hello World
4    Machine Learning
dtype: object

In [34]:
ser.str.strip()[0]

'Eshant Das'

In [35]:
ser.str.strip()[1]

'Data  Science'

In [36]:
ser.str.find('Geeks')

0   -1
1   -1
2    0
3   -1
4   -1
dtype: int64

In [37]:
ser

0         Eshant Das
1       Data  Science
2     Geeks for Geeks
3         Hello World
4    Machine Learning
dtype: object

In [38]:
ser.str.startswith('E')

0     True
1    False
2    False
3    False
4    False
dtype: bool

In [39]:
ser.str.endswith('E')

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [40]:
ser.str.find('greek')

0   -1
1   -1
2   -1
3   -1
4   -1
dtype: int64

In [41]:
ser.str.find('Geek')

0   -1
1   -1
2    0
3   -1
4   -1
dtype: int64

# convert into list

In [42]:
ser.to_list()

['Eshant Das ',
 ' Data  Science',
 'Geeks for Geeks',
 'Hello World',
 'Machine Learning']

# working on Data Frames..

In [43]:
lst = ['Geeks', 'For', 'Geeks', 'is', 'portal', 'for', 'Geeks']

In [44]:
print(pd.DataFrame(lst))

        0
0   Geeks
1     For
2   Geeks
3      is
4  portal
5     for
6   Geeks

In [45]:
_ = {'name':['teja','vamsi','pavan'] , 'rollno':[12,13,14]}
pd.DataFrame(_)

    name  rollno
0   teja      12
1  vamsi      13
2  pavan      14

In [46]:
data = { 'Name'         :['Jai', 'Princi', 'Gaurav', 'Anuj'],
         'Age'          :[27, 24, 22, 32],
         'Address'      :['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
         'Qualification':['Msc', 'MA', 'MCA', 'Phd']}

In [47]:
df = pd.DataFrame(data)
df

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

In [48]:
df['Name']

0       Jai
1    Princi
2    Gaurav
3      Anuj
Name: Name, dtype: object

In [49]:
data = {'one'   : pd.Series([1, 2, 3, 4]),
        'two'   : pd.Series([10, 20, 30, 40]),
        'three' : pd.Series([100, 200, 300, 400]),
        'four'  : pd.Series([1000, 2000, 3000, 4000])}

df1 = pd.DataFrame(data)
df1

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

# loc and iloc functions:-

In [50]:
df.loc[2:2]

     Name  Age    Address Qualification
2  Gaurav   22  Allahabad           MCA

In [51]:
df.iloc[:,3:4]

  Qualification
0           Msc
1            MA
2           MCA
3           Phd

In [52]:
df.loc[df['two']>10,['two','three']]

KeyError: 'two'

In [ ]:
df

# adding the new column

In [ ]:
df['five'] = [12,13,14,15]
df

# delecte the new column using del and pop functions...

In [ ]:
 df['six'] = df['five']+1
df

In [ ]:
del df['six']
df

In [ ]:
df.pop('five')

In [ ]:
df

# adding the new data in rows....

In [ ]:
df1 = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])

In [ ]:
df2 = pd.DataFrame([[5,6],[7,8]], columns = ['c','d'])

In [ ]:
df1

In [ ]:
df2

# drop function used to drop the paticular row and column in data by using axis
axis = 1 means rows, 
axis = 0 means column

In [ ]:
df1.drop(['one','two'],axis = 1, inplace = True)

In [ ]:
df1

In [ ]:
df1.drop([2,3], inplace = True)
df1

In [53]:
data = { 'one'   : pd.Series([1, 2, 3, 4]),
         'two'   : pd.Series([10, 20, 30, 40]),
         'three' : pd.Series([100, 200, 300, 400]),
         'four'  : pd.Series([2010, 2002, 3000, 4000])}

df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  2010
1    2   20    200  2002
2    3   30    300  3000
3    4   40    400  4000

# Tranpose function:-

In [54]:
df.T

          0     1     2     3
one       1     2     3     4
two      10    20    30    40
three   100   200   300   400
four   2010  2002  3000  4000

# axes function

In [55]:
df.axes

[RangeIndex(start=0, stop=4, step=1),
 Index(['one', 'two', 'three', 'four'], dtype='object')]

In [56]:
data = {'one'  : pd.Series([1, 2, 3, 4]),
        'two'  : pd.Series([10, 20, 30, 40]),
        'three': pd.Series([100, 200, 300, 400]),
        'four' : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

# pipe function:-

In [57]:
def add_(a):
    return a+10

In [58]:
df.pipe(add_)

   one  two  three  four
0   11   20    110  1010
1   12   30    210  2010
2   13   40    310  3010
3   14   50    410  4010

In [59]:
def mean_(col):
    return col.mean()

def square(i):
    return i ** 2

In [60]:
df.pipe(square)

   one   two   three      four
0    1   100   10000   1000000
1    4   400   40000   4000000
2    9   900   90000   9000000
3   16  1600  160000  16000000

In [61]:
df.pipe(mean_).pipe(square)

one            6.25
two          625.00
three      62500.00
four     6250000.00
dtype: float64

# Apply function:-

In [62]:
df.apply(lambda x:  x*100 )

   one   two  three    four
0  100  1000  10000  100000
1  200  2000  20000  200000
2  300  3000  30000  300000
3  400  4000  40000  400000

In [63]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

# sort function

In [64]:
df.sort_values(by = 'one')

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [65]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [66]:
df.sort_values(by = 'four', ascending =False)

   one  two  three  four
3    4   40    400  4000
2    3   30    300  3000
1    2   20    200  2000
0    1   10    100  1000

In [67]:
cricket = {'Team'   : ['India', 'India', 'Australia', 'Australia', 'SA', 'SA', 'SA', 'SA', 'NZ', 'NZ', 'NZ', 'India'],
           'Rank'   : [2, 3, 1,2, 3,4 ,1 ,1,2 , 4,1,2],
           'Year'   : [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
           'Points' : [876,801,891,815,776,784,834,824,758,691,883,782]}

df = pd.DataFrame(cricket)
df

         Team  Rank  Year  Points
0       India     2  2014     876
1       India     3  2015     801
2   Australia     1  2014     891
3   Australia     2  2015     815
4          SA     3  2014     776
5          SA     4  2015     784
6          SA     1  2016     834
7          SA     1  2017     824
8          NZ     2  2016     758
9          NZ     4  2014     691
10         NZ     1  2015     883
11      India     2  2017     782

# working on groupby function:-

In [68]:
df1 = df.groupby('Team').groups

In [69]:
print(df1)

{'Australia': [2, 3], 'India': [0, 1, 11], 'NZ': [8, 9, 10], 'SA': [4, 5, 6, 7]}

In [70]:
df.groupby(['Team','Year']).get_group(('Australia',2014))

        Team  Rank  Year  Points
2  Australia     1  2014     891

In [71]:
df.groupby(['Team']).sum()['Points'].sort_values(ascending = False)

Team
SA           3218
India        2459
NZ           2332
Australia    1706
Name: Points, dtype: int64